app/controllers/topics_controller.rb

INSERT INTO "topics" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "123"], ["description", "1234"], ["created_at", "2016-05-17 11:57:22.012445"], ["updated_at", "2016-05-17 11:57:22.012445"]]
---
  def create
    @topic = Topic.new(topic_params)

    respond_to do |format|
      if @topic.save

DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 1]]
---
  def destroy
    @topic.destroy

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "votes" ("topic_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["topic_id", 2], ["created_at", "2016-05-17 14:24:25.685547"], ["updated_at", "2016-05-17 14:24:25.685547"]]
---
    def upvote
      @topic = Topic.find(params[:id])
      @topic.votes.create

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 8]]
SELECT  "votes".* FROM "votes" WHERE "votes"."topic_id" = ?  ORDER BY "votes"."id" ASC LIMIT 1  [["topic_id", 3]]
---
    def downvote
      @topic = Topic.find(params[:id])
      @topic.votes.first.destroy